#!/usr/bin/env python
# -*- coding:utf-8 -*-
# Author:ZhengzhengLiu
 
#线性回归——家庭用电预测（时间与电压之间的多项式关系）
import sys
sys.path.append('./')
import sklearn
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import PolynomialFeatures    #多项式
from sklearn.pipeline import Pipeline
from sklearn.model_selection import GridSearchCV    #带有交叉验证的网格搜索
 
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import pandas as pd
import time
 
#创建时间处理的函数
def time_format(x):
    #join方法取出的两列数据用空格合并成一列
    #用strptime方法将字符串形式的时间转换成时间元祖struct_time
    t = time.strptime(" ".join(x), "%d/%m/%Y %H:%M:%S")   #日月年时分秒的格式
    # 分别返回年月日时分秒并放入到一个元组中
    return (t.tm_year, t.tm_mon, t.tm_mday, t.tm_hour, t.tm_min, t.tm_sec)
 
#解决中文问题
mpl.rcParams["font.sans-serif"] = [u"SimHei"]
mpl.rcParams["axes.unicode_minus"] = False
 
#导入数据
path = "../../datas/household_power_consumption_1000.txt"
data = pd.read_csv(path,sep=";",low_memory=False)
 
#日期，时间，有功功率，无功功率，电压，电流，厨房用电功率，洗衣服用电功率，热水器用电功率
 
names = ['Date','Time','Global_active_power','Global_reactive_power','Voltage','Global_intensity','Sub_metering_1','Sub_metering_2','Sub_metering_3']
 
#异常数据处理（异常数据过滤）
new_data = data.replace("?",np.nan)
datas = new_data.dropna(axis=0, how="any")       #只要有数据为空就进行行删除操作
 
#时间与电压之间的关系（Liner--多项式）
models = [
    Pipeline([
        ('Poly',PolynomialFeatures()),
        ('Linear',LinearRegression(fit_intercept=False))
    ])
]
 
model = models[0]
 
#获取x和y变量，并将时间转换成数值连续型变量
xdata = data.iloc[:,0:2]
x = xdata.apply(lambda x:pd.Series(time_format(x)),axis=1)  #apply方法表示对xdata应用后面的转换形式
y = data.iloc[:,4]      #取出Y的数据（电压）
 
#划分测试集和训练集，random_state是随机数发生器使用的种子
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.3,random_state=0)
 
#对数据的训练集和测试集进行标准化
ss = StandardScaler()
#fit做运算，计算标准化需要的均值和方差；transform是进行转化
x_train = ss.fit_transform(x_train)
x_test = ss.transform(x_test)
 
#模型训练
t = np.arange(len(x_test))
N = 5
d_pool = np.arange(1,N,1)   #阶
m = d_pool.size
clrs = []       #颜色
for c in np.linspace(16711680,255,m):
    clrs.append('#%06x' % int(c))
line_width = 3
 
plt.figure(figsize=(12,6),facecolor='w')    #创建绘图窗口，设置大小和背景颜色
for i,d in enumerate(d_pool):
    plt.subplot(N-1,1,i+1)
    plt.plot(t,y_test,"r-",label = "真实值",ms = 10,zorder=N)
    model.set_params(Poly__degree=d)    #set_params函数对Pipeline中的某个模型设置参数
    model.fit(x_train,y_train)
    lin = model.get_params('Linear')['Linear']
    output = u"%d阶，系数为：" % d
    print(output, lin.coef_.ravel())  # ravel方法将数组拉直，多维数组将为一维
 
    y_hat = model.predict(x_test)
    s = model.score(x_test,y_test)
    z = N-1 if (d==2) else 0
    label = u"%d阶，准确率为：%.3f" % (d, s)
    plt.plot(t, y_hat, color=clrs[i], lw=line_width, alpha=0.75, label=label, zorder=z)
    plt.legend(loc="upper left")
    plt.grid(True)
    plt.ylabel(u"%d阶结果" % d, fontsize=12)
 
plt.legend(loc="lower right")
plt.suptitle(u"线性回归预测时间与电压之间的多项式关系",fontsize=20)
plt.grid(True)
plt.show()
 
# #运行结果：
# 1阶，系数为： [  2.39902814e+02   0.00000000e+00   1.11022302e-16   4.23207026e+00
#    1.12142760e+00   2.02166226e-01   0.00000000e+00]
# 2阶，系数为： [ -1.11539792e+13   2.92968750e-03  -6.83593750e-03   4.14912590e+12
#    3.23876953e+00   3.21350098e-01   7.99560547e-03   2.44140625e-04
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   1.11539792e+13  -2.54700928e+01
#   -6.71875000e-01   0.00000000e+00  -1.03660889e+01  -5.82519531e-01
#    0.00000000e+00  -8.44726562e-02   0.00000000e+00   0.00000000e+00]
# 3阶，系数为： [ -1.63002196e+13  -1.06171697e+12  -2.19799440e+13   2.68220670e+13
#   -2.01883991e+13   1.17965159e+13   4.59169674e+12   1.33751216e+13
#   -7.30563919e+11   2.49935263e+12  -3.41816728e+12   4.70268465e+12
#    3.41993070e+12   4.34249277e+12  -2.36933344e+12   1.99575089e+12
#    1.66261330e+12   0.00000000e+00   8.57830362e+12   7.50980509e+12
#   -4.38814065e+12   0.00000000e+00   7.84667969e-01   1.88476562e-01
#    0.00000000e+00  -4.19921875e-02   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#   -2.07586109e+13   2.01883991e+13  -1.17965159e+13   0.00000000e+00
#   -7.69610596e+00  -5.44921875e-01   0.00000000e+00  -8.59375000e-02
#    0.00000000e+00   0.00000000e+00   3.87646484e+00   2.26562500e-01
#    0.00000000e+00  -1.87500000e-01   0.00000000e+00   0.00000000e+00
#   -2.16796875e-01   0.00000000e+00   0.00000000e+00   0.00000000e+00]
# 4阶，系数为： [ -6.00682517e+11  -3.29239328e+12   1.86141729e+13   6.93021510e+11
#    2.69953823e+12  -6.17642085e+11  -2.70513938e+12  -1.02422258e+12
#    1.91156682e+12  -7.75735474e+11  -1.00006158e+12  -3.39208470e+11
#    5.77229194e+11   4.27298991e+11  -1.07091942e+12   4.84607019e+11
#    2.02165069e+12   8.34755567e+10   8.99308537e+12  -9.15830049e+12
#   -5.29757907e+11  -8.45993774e+10   9.23510075e+12  -6.18929887e+11
#    3.35305892e+10   8.50306093e+12  -7.26209570e+10  -1.36507996e+10
#    1.00507638e+10   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#   -3.65641060e+12   3.33677698e+11   9.00170118e+11   0.00000000e+00
#   -3.43532967e+12   2.30233352e+11   0.00000000e+00  -3.16302099e+12
#    0.00000000e+00   0.00000000e+00  -1.65683594e+01  -1.81250000e+00
#    0.00000000e+00  -3.91601562e-01   0.00000000e+00   0.00000000e+00
#   -2.19726562e-01   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00   0.00000000e+00  -8.56707860e+12
#    8.15410963e+12   7.59512214e+11   0.00000000e+00  -9.23510075e+12
#    6.18929887e+11   0.00000000e+00  -8.50306093e+12   0.00000000e+00
#    0.00000000e+00  -3.61572266e-01  -8.24658203e+00   0.00000000e+00
#   -7.02392578e-01   0.00000000e+00   0.00000000e+00  -7.81250000e-02
#    0.00000000e+00   0.00000000e+00   0.00000000e+00  -7.55639648e+00
#   -3.84765625e+00   0.00000000e+00  -5.38574219e-01   0.00000000e+00
#    0.00000000e+00   1.22070312e-01   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   1.22070312e-02   0.00000000e+00   0.00000000e+00
#    0.00000000e+00   0.00000000e+00]
